export const skillsData = [
  {
    id: 1,
    bio: `Frontend :
    - HTML: 기본 태그 사용에 익숙하며, 웹 페이지의 구조를 설계할 수 있음.
    - CSS: 스타일링과 레이아웃 기본을 이해하며, 간단한 디자인 적용 가능.
    - Javascript: 기본적인 문법과 작동 원리를 이해하고, 간단한 상호작용을 구현할 수 있음.
    - Typescript: 기본적인 타입 사용에 익숙하며, Javascript에 타입 안정성을 추가할 수 있음.
    - ReactJS: 컴포넌트 기반 아키텍처를 이해하고, 상태 관리 및 기본적인 훅 사용에 익숙함.
    - NextJS: 기본적인 라우팅과 정적 생성에 대한 이해가 있으며, 간단한 프로젝트에 적용 가능.
    - Redux: 상태 관리의 기본 개념을 이해하고, 간단한 전역 상태 관리를 설정할 수 있음.
    - Recoil: React의 상태 관리에 대한 초보적 이해가 있으나, 실제 사용 경험은 제한적.
    - Bootstrap: 반응형 레이아웃과 기본 컴포넌트 사용법을 알고 있음.
    - Tailwind CSS: 유틸리티 클래스를 이용한 스타일링에 대한 기본적인 이해가 있음.
    - React Query: 백엔드와의 데이터 동기화에 대한 기본적인 이해가 있으나, 실무 경험은 적음.
    - React Hook Form: 양식 검증과 관리에 대해 알고 있으나, 다양한 케이스에서의 사용 경험은 아직 적음.`,
  },
  {
    id: 2,
    bio: `Backend :
    - Java: 기본적인 객체 지향 개념을 이해하며, 간단한 자바 애플리케이션을 작성할 수 있음.
    - Spring: 프레임워크의 기본적인 기능을 알고 있으나, 복잡한 엔터프라이즈급 애플리케이션 구축 경험은 제한적임.
    - Firebase: 실시간 데이터베이스와 인증 기능을 이용한 간단한 프로젝트 경험이 있으며, 다른 기능에 대한 이해는 초보 수준임.`,
  },
  {
    id: 3,
    bio: `Communication:
    - Jira: 기본적인 이슈 추적 및 프로젝트 관리 기능을 사용해 본 경험이 있으며, Agile 방법론에 대한 초보적 이해가 있음.
    - Figma: 디자인 기본 개념을 알고 있으며, 간단한 인터페이스 디자인과 프로토타입 제작을 수행할 수 있음. 협업 기능 사용 경험은 제한적임.
    - Confluence: 문서 작성과 팀 내 지식 공유에 사용해 본 경험이 있으나, 플랫폼의 고급 기능에 대한 이해는 아직 초보 수준임.`,
  },
  {
    id: 4,
    bio: `Mobile App:
    - React Native: React의 기본적인 사용법을 이해하고 있으며, 간단한 네이티브 애플리케이션 구축 경험이 있음. 하지만, iOS와 Android의 특정 네이티브 기능들에 대한 깊은 이해는 아직 필요함.
`,
  },
  {
    id: 5,
    bio: `Deployment:
- Amazon Web Services (AWS): 기본적인 서비스 이해도가 있으나, 활용 경험은 제한적. 예를 들어, 정적 웹 사이트 호스팅을 위한 S3 사용에 익숙할 수 있음.
- Netlify: 간단한 프로젝트를 배포해 본 경험이 있으며, 자동 배포 및 기타 기본 기능에 대한 이해도가 있음.
- Vercel: 주로 Next.js 프로젝트에 사용해 보았고, 간단한 배포 프로세스를 이해하고 있으나, 고급 설정은 아직 경험해보지 못함.
- Docker: 컨테이너 개념을 이해하고 기본적인 Dockerfile을 작성할 수 있으나, 복잡한 멀티 컨테이너 환경 구성은 아직 경험 부족.
- Firebase: 인증 및 데이터베이스 관리 등의 기본적인 백엔드 서비스를 활용한 경험이 있으나, 모든 기능에 대한 깊은 이해는 필요함.`,
  },
  {
    id: 3,
    bio: ``,
  },
];